models/serviceClasses/AddEdit.php

    public function getStockData() : array
    {
        $stock = Stock::find()->where(['id' => $this->id]);
---
SELECT * FROM `stock` WHERE `id`='27'

	public function getDataTables()
    {
		$tabs = [
            'modeller3d',
            'model_type',
            'model_material',
            'model_covering',
            'handling',
            'metal_color',
            'vc_names',
            'gems_color',
            'gems_cut',
            'gems_names',
            'gems_sizes',
            'metal_probe',
            'hashtag',
        ];
		$tables = [];

        $service_data = Service_data::find()->asArray()->orderBy('name')->all();
---
SELECT * FROM `service_data` ORDER BY `name`