models/serviceClasses/JewelStore.php

SELECT EXISTS(SELECT * FROM `jewelbox` WHERE `userid`=69)
SELECT * FROM `jewelbox` WHERE `userid`=69
---
    public static function getModelsCount() : int
    {
        $jb = Jewelbox::find()->where(['userid'=>User::getID()])->andWhere(['status'=>0]);
        if ($jb->exists()) {