models/serviceClasses/ModelView.php

SELECT * FROM `stock` WHERE `id` = 6 LIMIT 1
---
	public function getStockData()
    {
        $this->row = Stock::find()
            ->with(['images','materials','gems','d3_files'])
            ->where(['=','id',$this->id])
            ->asArray()
            ->limit(1)
            ->one();