models/serviceClasses/SaveModel.php

SELECT EXISTS(SELECT `id`, `model_status` FROM `stock` WHERE (`id`=27) AND (`model_status`=2))
---
    public function publishAllModels() : string
    {
        $stock = Stock::find();
        if ( User::hasPermission('edit_all_models') )
        {
            $stock = $stock->andWhere(['model_status'=>0]);
        } elseif ( User::hasPermission('edit_own_models') )
        {
            // only self models
            $stock = $stock->andWhere(['model_status'=>0])
                ->andWhere(['creator_id'=>User::getID()]);
        } else {
            return 'false';
        }

        $stock = $stock->all();