models/serviceClasses/UsersAll.php

SELECT `id`, `name`, `description` FROM `permissions`
---
    public function getBasicData( string $stab='' ) : array
    {
        $res = ['clients'=>[],'roles'=>[],'perm'=>[]];
        $res['clients'] = Service_data::find()->where(['tab'=>'client'])->asArray()->orderBy('name')->all();
        $res['roles'] = Service_data::find()->where(['tab'=>'role'])->asArray()->orderBy('name')->all();
        $res['perm'] = Permissions::find()->select(['id','name','description'])->asArray()->all();