models/Common.php

SELECT * FROM `service_data` WHERE `tab`='hashtag' ORDER BY `name`
---
	public function getClients() : array
	{
		self::$clients = Service_data::find()->where(['tab'=>'client'])->asArray()->orderBy('name')->all();