models/Common.php

	public function getClients() : array
	{
		self::$clients = Service_data::find()->where(['tab'=>'client'])->asArray()->orderBy('name')->all();

		if ( User::hasPermission('clientall') )
			return self::$clients;

		if ( User::hasPermission('clientonly') )
		{
			$ids = User::getClientsID( self::$clients );
			return self::$clients = Service_data::find()->where(['tab'=>'client'])->andWhere(['in','id',$ids])->asArray()->orderBy('name')->all();
---
SELECT * FROM `service_data` WHERE `tab`='client' ORDER BY `name`
SELECT * FROM `service_data` WHERE (`tab`='client') AND (`id` IN (284, 285)) ORDER BY `name`

	public function getAllRoles()
	{
		if ( isset(self::$roles) ) return self::$roles;
		return self::$roles = Service_data::find()->where(['tab'=>'role'])->asArray()->orderBy('name')->all();
---
SELECT * FROM `service_data` WHERE `tab` IN ('metal_color', 'model_material', 'metal_probe') ORDER BY `name`

	public function getAllHashtags() : array
	{
		return Service_data::find()->where(['tab'=>'hashtag'])->asArray()->orderBy('name')->all();
---
SELECT * FROM `service_data` WHERE `tab`='hashtag' ORDER BY `name`

	public function getAllModelTypes() : array
	{
		return Service_data::find()->where(['tab'=>'model_type'])->asArray()->orderBy('name')->all();
---
SELECT * FROM `service_data` WHERE `tab`='model_type' ORDER BY `name`

	public function getAllMaterials() : array
	{
		$mats = Service_data::find()->where(['in','tab',['metal_color','model_material','metal_probe']])->asArray()->orderBy('name')->all();
---
SELECT * FROM `service_data` WHERE `tab` IN ('metal_color', 'model_material', 'metal_probe') ORDER BY `name`

	public function getNonPublished()
	{
		$stock = Stock::find()->where(['model_status' => 0]);

		if ( User::hasPermission('edit_own_models') )
			$stock->andWhere(['creator_id' => User::getID() ]);

		$stock = $stock->with(['images'])->asArray()->all();
---
SELECT * FROM `stock` WHERE (`model_status`=0) AND (`creator_id`=69)