models/User.php

    public static function getUsernameByID( int $id ) : string
    {
        if ( $id < 0 || $id > PHP_INT_MAX )
            throw new \Exception("We got no user sorry!", 510);
        $u = Users::find()->select(['id','fio'])
            ->where(['id'=>$id])
            ->asArray()
            ->one();
---
SELECT `id`, `fio` FROM `users` WHERE `id`=69

    public static function init( int $userID=null, array $user=[] ) : array
    {
        if ( isset(self::$userInstance) && is_array(self::$userInstance) )
            return self::$userInstance;

        if ( $user ) {
            return self::$userInstance = $user;
        }
        if ( $userID < 0 || $userID > PHP_INT_MAX )
            throw new \Exception("We got no user sorry!", 510);

        if ( !$userID )
        {
            // Try to get user by id from Session
            $user = Yii::$app->session->get('user');
            if ( !isset($user['id']) )
                throw new \Exception("We got no user sorry!", 511);

            $userID = $user['id'];
        }

        self::$userInstance = Users::find()->where(['id'=>$userID])->asArray()->one();
---
SELECT * FROM `users` WHERE `id`=69

    public static function permissions() : array
    {
        if ( isset(self::$permissions) ) return self::$permissions;

        $user = self::userInstance();
        $permissions = Permissions::find()->select(['id','name','description'])->asArray()->all();
---
SELECT `id`, `name`, `description` FROM `permissions`